grevaillot/svd_tools/headers/STM32H753x/dmamux2.h
#define DMAMUX2_C2CR_NBREQ_SHIFT		19
#define DMAMUX2_C2CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_c2cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX2_C2CR_SPOL_SHIFT		17
#define DMAMUX2_C2CR_SPOL_MASK		0x03
/** @defgroup dmamux2_c2cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX2_C2CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX2_C2CR_SE		(1 << 16)
/** DMAMUX2_C2CR_EGE Event generation enable/disable **/
#define DMAMUX2_C2CR_EGE		(1 << 9)
/** DMAMUX2_C2CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX2_C2CR_SOIE		(1 << 8)

#define DMAMUX2_C2CR_DMAREQ_ID_SHIFT		0
#define DMAMUX2_C2CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux2_c2cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_c3cr C3CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_C3CR_SYNC_ID_SHIFT		24
#define DMAMUX2_C3CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_c3cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_C3CR_NBREQ_SHIFT		19
#define DMAMUX2_C3CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_c3cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX2_C3CR_SPOL_SHIFT		17
#define DMAMUX2_C3CR_SPOL_MASK		0x03
/** @defgroup dmamux2_c3cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX2_C3CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX2_C3CR_SE		(1 << 16)
/** DMAMUX2_C3CR_EGE Event generation enable/disable **/
#define DMAMUX2_C3CR_EGE		(1 << 9)
/** DMAMUX2_C3CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX2_C3CR_SOIE		(1 << 8)

#define DMAMUX2_C3CR_DMAREQ_ID_SHIFT		0
#define DMAMUX2_C3CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux2_c3cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_c4cr C4CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_C4CR_SYNC_ID_SHIFT		24
#define DMAMUX2_C4CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_c4cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_C4CR_NBREQ_SHIFT		19
#define DMAMUX2_C4CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_c4cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX2_C4CR_SPOL_SHIFT		17
#define DMAMUX2_C4CR_SPOL_MASK		0x03
/** @defgroup dmamux2_c4cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX2_C4CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX2_C4CR_SE		(1 << 16)
/** DMAMUX2_C4CR_EGE Event generation enable/disable **/
#define DMAMUX2_C4CR_EGE		(1 << 9)
/** DMAMUX2_C4CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX2_C4CR_SOIE		(1 << 8)

#define DMAMUX2_C4CR_DMAREQ_ID_SHIFT		0
#define DMAMUX2_C4CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux2_c4cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_c5cr C5CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_C5CR_SYNC_ID_SHIFT		24
#define DMAMUX2_C5CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_c5cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_C5CR_NBREQ_SHIFT		19
#define DMAMUX2_C5CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_c5cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX2_C5CR_SPOL_SHIFT		17
#define DMAMUX2_C5CR_SPOL_MASK		0x03
/** @defgroup dmamux2_c5cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX2_C5CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX2_C5CR_SE		(1 << 16)
/** DMAMUX2_C5CR_EGE Event generation enable/disable **/
#define DMAMUX2_C5CR_EGE		(1 << 9)
/** DMAMUX2_C5CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX2_C5CR_SOIE		(1 << 8)

#define DMAMUX2_C5CR_DMAREQ_ID_SHIFT		0
#define DMAMUX2_C5CR_DMAREQ_ID_MASK		0xff
/** @defgroup dmamux2_c5cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux2_c6cr C6CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX2_C6CR_SYNC_ID_SHIFT		24
#define DMAMUX2_C6CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux2_c6cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX2_C6CR_NBREQ_SHIFT		19
#define DMAMUX2_C6CR_NBREQ_MASK		0x1f
/** @defgroup dmamux2_c6cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


